posts/2015-09-25-the-perfect-church.org
#+date: <2015-09-25>
#+filetags: prayer religion
#+title: The Perfect Church

A prayer for those searching for the perfect church:

Lord Jesus,

We move from\\
church to church,\\
searching for one\\
that meets our needs,\\
one that is perfect\\
for people like us.\\
\\
But what do we hope to find?\\
A church filled\\
with perfect people?\\
People who have no faults,\\
who speak no unkind words,\\
who never hurt one another,\\
and never have regrets?\\
\\
A perfect church, indeed,\\
but a church with no place\\
for one like me,\\
a broken spirit\\
who needs\\
grace,\\
love,\\
healing,\\
and mercy.\\
\\
And so, I bow in prayer,\\
to ask for a church\\
filled with those\\
who are broken and flawed,\\
hurting and in sorrow,\\
who are there because\\
they know that together,\\
with you,\\
they can find\\
grace and mercy,\\
healing, and hope\\
in that place\\
they call their church.\\
\\
Then I open my eyes\\
to find that my prayer\\
has already been answered.\\
\\
Thank you, Lord,\\
for leading me home.\\

/Amen/



#+begin_tagline
Tagged: [[file:../tags/prayer.org][Prayer]] [[file:../tags/religion.org][Religion]]
#+end_tagline
