docs/posts/2015-09-25-the-perfect-church.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Perfect Church</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">The Perfect Church</h1>
<p class="subtitle" role="doc-subtitle">Sep 25, 2015</p>
</header><p>
A prayer for those searching for the perfect church:
</p>

<p>
Lord Jesus,
</p>

<p>
We move from<br>
church to church,<br>
searching for one<br>
that meets our needs,<br>
one that is perfect<br>
for people like us.<br>
<br>
But what do we hope to find?<br>
A church filled<br>
with perfect people?<br>
People who have no faults,<br>
who speak no unkind words,<br>
who never hurt one another,<br>
and never have regrets?<br>
<br>
A perfect church, indeed,<br>
but a church with no place<br>
for one like me,<br>
a broken spirit<br>
who needs<br>
grace,<br>
love,<br>
healing,<br>
and mercy.<br>
<br>
And so, I bow in prayer,<br>
to ask for a church<br>
filled with those<br>
who are broken and flawed,<br>
hurting and in sorrow,<br>
who are there because<br>
they know that together,<br>
with you,<br>
they can find<br>
grace and mercy,<br>
healing, and hope<br>
in that place<br>
they call their church.<br>
<br>
Then I open my eyes<br>
to find that my prayer<br>
has already been answered.<br>
<br>
Thank you, Lord,<br>
for leading me home.<br>
</p>

<p>
<i>Amen</i>
</p>



<div class="tagline" id="org3f0f6d1">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
